import telebot
import constant
import os
from datetime import datetime

bot = telebot.TeleBot('711136047:AAHaBWKkhWWCvlICKUY9RhFBDLtSHzOcaXI')

def chandroz(y, m,d):
    sum = y // 4
    sum = sum + (y * 365)
    if m <= 6:
        sum = sum + ((m - 1) * 31) + d
    else:
        sum = sum + (6 * 31) + d
        sum = sum + ((m - 7) * 30)
    return sum

def DayOfWeek_Shamsi(y, m, d):
    sum=(chandroz(y,m,d)+1)%7
    if(sum == 0):
        sum = "شنبه"
    elif(sum == 1):
        sum = "یک شنبه"
    elif (sum == 2):
        sum = "دو شنبه"
    elif (sum == 3):
        sum = "سه شنبه"
    elif (sum == 4):
        sum = "چهار شنبه"
    elif (sum == 5):
        sum = "پنج شنبه"
    elif (sum == 6):
        sum = "جمعه"
    return sum

def shamsi_to_miladi(jy,jm,jd):
 if(jy>979):
  gy=1600
  jy-=979
 else:
  gy=621
 if(jm<7):
  days=(jm-1)*31
 else:
  days=((jm-7)*30)+186
 days+=(365*jy) +((int(jy/33))*8) +(int(((jy%33)+3)/4)) +78 +jd
 gy+=400*(int(days/146097))
 days%=146097
 if(days > 36524):
  gy+=100*(int(--days/36524))
  days%=36524
  if(days >= 365):
   days+=1
 gy+=4*(int(days/1461))
 days%=1461
 if(days > 365):
  gy+=int((days-1)/365)
  days=(days-1)%365
 gd=days+1
 if((gy%4==0 and gy%100!=0) or (gy%400==0)):
  kab=29
 else:
  kab=28
 sal_a=[0,31,kab,31,30,31,30,31,31,30,31,30,31]
 gm=0
 while(gm<13):
  v=sal_a[gm]
  if(gd <= v):
   break
  gd-=v
  gm+=1
 return gy,gm,gd

def miladi_to_shamsi (gy,gm,gd):
 g_d_m=[0,31,59,90,120,151,181,212,243,273,304,334]
 if(gy>1600):
  jy=979
  gy-=1600
 else:
  jy=0
  gy-=621
 if(gm>2):
  gy2=gy+1
 else:
  gy2=gy
 days=(365*gy) +(int((gy2+3)/4)) -(int((gy2+99)/100)) +(int((gy2+399)/400)) -80 +gd +g_d_m[gm-1]
 jy+=33*(int(days/12053))
 days%=12053
 jy+=4*(int(days/1461))
 days%=1461
 if(days > 365):
  jy+=int((days-1)/365)
  days=(days-1)%365
 if(days < 186):
  jm=1+int(days/31)
  jd=1+(days%31)
 else:
  jm=7+int((days-186)/30)
  jd=1+((days-186)%30)
 return jy,jm,jd

def mohesebesen(y,m,d):
    today = datetime.today()
    #x = shamsi_to_miladi(y+1300, m, d)
    x = miladi_to_shamsi(today.year, today.month, today.day)
    roz = chandroz(x[0],x[1],x[2]) - chandroz(y+1300,m,d)
    #print(roz)
    #roz = chandroz(int(str(today.year)[2:4]), today.month, today.day) - chandroz(int(str(x[0])[2:4]),)
    sal = roz // 365
    roz2 = roz - (sal * 365)
    roz2 = roz2 - (sal // 4)
    hafte = roz//7
    hour = roz*24 + today.hour
    min = hour*60 + today.minute
    secend = min*60 + today.second
    return [hafte, roz, hour, min, secend, sal, roz2]

def chesali(y):
    if (y % 12 == 0):
        ans = "مار"
    elif (y % 12 == 1):
        ans = "اسب"
    elif (y % 12 == 2):
        ans = "بز"
    elif (y % 12 == 3):
        ans = "میمون"
    elif (y % 12 == 4):
        ans = "خروس"
    elif (y % 12 == 5):
        ans = "سگ"
    elif (y % 12 == 6):
        ans = "خوک"
    elif (y % 12 == 7):
        ans = "موش"
    elif (y % 12 == 8):
        ans = "گاو"
    elif (y % 12 == 9):
        ans = "ببر"
    elif (y % 12 == 10):
        ans = "گربه"
    elif (y % 12 == 11):
        ans = "اژدها"
    return ans

def chandroztosalgard(m,d):
    today = datetime.today()
    x = miladi_to_shamsi(today.year, today.month, today.day)
    if(m>=x[1]):
        roz = chandroz(int(str(x[0])[2:4]), m, d) - chandroz(int(str(x[0])[2:4]), x[1], x[2])
    else:
        roz = chandroz(int(str(x[0])[2:4]) + 1, m, d) - chandroz(int(str(x[0])[2:4]), x[1], x[2])
    if(d>=x[2]):
        roz2 = d - x[2]
    else:
        if (m<=6):
            roz2 = (d+31) - x[2]
        elif (m==12):
            roz2 = (d + 29) - x[2]
        else:
            roz2 = (d + 30) - x[2]
    roz = roz - roz2
    moh = roz // 29
    return moh, roz2

def darbaremah(m):
    if(m==1):
        ans="خصوصیات متولدین حمل(فروردین):\nسمبل: قوچ \nعنصر: آتش \nسیاره: مریخ \nعضو آسیب‌پذیر: سر \nروز اقبال: سه شنبه \nسنگ خوش‌یمن: الماس \nرنگ: قرمز\nویژگی‌های بارز: \nخوش رفتار، صميمی، پيشرو، ماجرا جو، پرتوقع، خودخواه، رمانتيك و عاشق پيشه، آتشی و پرحرارت، اهل اعتراض و مرافعه، رك گو و عجول، مخالف دنباله روی، می‌خواهد يك قدم جلوتر از ديگران باشد، ترجيح می‌دهد بميرد و شكست نخورد، آتش تندش زود خاموش می‌شود، مخالف هر گونه اعتياد، در باطن ضعيف تر از ظاهر."
    elif (m == 2):
        ans="خصوصيات متولدين ثور ( ارديبهشت)\nسمبل: گاو نر \nعنصر: خاك \nسیاره: ناهید \nعضو آسیب پذیر: گردن \nروز اقبال: جمعه \nاعداد شانس: 4 و 6 \nسنگ خوش یمن: زمرد سبز \nرنگ: آبی روشن \nگل: خشخاش \nحیوان: گاو\nویژگی‌های بارز :\nصبور و آرام، پر تحمل، قوی، بامحبت، عاشق طبيعت، باسلیقه، خوشگل پسند، پول دوست، خودسر، واقع‌بین، محتاط، عاشق خانه و خانواده، مخالف عجله و شتاب، دارای رگ لجبازی، كارش روی حساب است، مخالف جلف بازی و سبک‌سری، اگر عصبانی شود طوفان به پا می‌کند."
    elif (m == 3):
        ans="خصوصيات متولدين جوزا ( خرداد)\nسمبل: دو قلوها \nعنصر: هوا \nسیاره: عطارد \nعضو آسیب پذیر: دست و شانه \nروز اقبال: چهارشنبه \nاعداد شانس: 5 و 9 \nسنگ خوش یمن: عقیق \nرنگ: زرد \nگل: زنبق \nحیوان: پروانه\nویژگی‌های بارز :\nسياستمدار، خوش سر و زبان، اهل معاشرت، كنجكاو، سلطان سليقه، زيرك، ناآرام، اهل تنوع، ناپايدار، چند شخصيتی، در جستجوی مطالب جديد، از تغيير وضع به هيجان می‌آید، فاقد حس حسادت، مردم‌دار، خواهان وفاداری، دوست دارد مرموز جلوه كند."
    elif (m == 4):
        ans = "خصوصيات متولدين سرطان (تير)\nسمبل: خرچنگ \nعنصر: آب \nسیاره: ماه \nعضو آسیب پذیر: سینه و شكم \nروز اقبال: دوشنبه \nاعداد شانس: 3 و 7 \nسنگ خوش یمن: مروارید \nرنگ: نقره ای \nحیوان: حیوانات صدفدار\nویژگی‌های بارز خوش: \nحافظه، سريع الانتقال، رازدار، خنده رو و شوخ، خيلی حساس، گرفتار وحشت و ترسی ناپيدا، احتياج به كمك ديگران دارد، عاشق زندگی زناشوئی، مطيع همسر خود، متنفر از انتقاد، عاشق عتيقه و اشياء كهنه، صرفه جو و دور انديش، طرفدار طبيعت و مهتاب و آب دريا."
    elif (m == 5):
        ans ="خصوصيات متولدين اسد ( مرداد )\nسمبل: شیر \nعنصر: آتش \nسیاره: خورشید \nعضو آسیب‌پذیر: قلب و پشت بدن \nروز اقبال: یكشنبه \nاعداد شانس: 8 و 9 \nسنگ خوش‌یمن: یاقوت \nرنگ: زرد \nگل: آفتابگردان \nحیوان: گربه سانان\nویژگی‌های بارز: \nمغرور، سخاوتمند، دارای حس فرماندهی، بلندنظر و ریاست‌طلب، دوستدار تجمل و تعريف و تمجيد، با مناعت و مغرور، سخت‌کوش و مقاوم، با گذشت ولی خودخواه، فاقد بد ذاتی و شقاوت، رفیق‌باز، صديق و مهربان، بدون عشق نمی‌تواند زندگی كند، خشم او طولانی است"
    elif (m == 6):
        ans = "خصوصيات متولدين سنبله ( شهريور )\nسمبل: سنبله\nعنصر: خاك \nسیاره: عطارد \nعضو آسیب پذیر: سیستم عصبی \nروز اقبال: چهارشنبه \nاعداد شانس: 3 و 5 \nسنگ خوش یمن: یاقوت كبود \nرنگ: سبز \nگل: بنفشه \nحیوان: سگ كوچك - گربه\nویژگی‌های بارز: \nمتين، شيك پوش، صرفه جو، صميمی، دورانديش و هوشمند، منظم، دقيق و كنجكاو، وظيفه شناس، سالم و تندرست، در انتقاد وسواسی و صريح، هوشيار و كمال جو، در عشق كم حرارت و اما جاودانه، اهل اعتدال و ميانه روی، هر كاری را عالی انجام می‌دهد."
        #pic = '1.PNG'
    elif (m == 7):
        ans = "خصوصيات متولدين ميزان (مهر)\nسمبل: ترازو \nعنصر: هوا \nسیاره: ونوس \nعضو آسیب پذیر: كمر و كلیه ها \nروز اقبال: جمعه \nاعداد شانس: 6 و 9 \nسنگ خوش یمن: الماس \nرنگ: آبی و بنفش \nگل: سرخ \nحیوان: خزندگان\nویژگی‌های بارز: \nجذاب و خوش قيافه، منصف و با مروت، گاه يكدنده و لج باز، شيرين بيان، حامی و پشتيبان همسرش، عاشق موسيقی و هنر و ادبيات، خجالتی اما پر احساس، اهل حمايت از ديگران، بهترين قاضی برای طرفين منازعه، همواره در جستجوی تعادل، بيزار از جنگ و منازعه، مردم دوست و خوش معاشرت، گاه تنبل و بی اعتنا، دو دل و مردد."
    elif (m == 8):
        ans ="خصوصيات متولدين عقرب ( آبان)\nسمبل: عقرب \nعنصر: آب \nسیاره: پلوتون \nروز اقبال: سه شنبه \nاعداد شانس: 2 و 4 \nسنگ خوش‌یمن: یاقوت زرد \nرنگ: قرمز \nحیوان: حشرات\nویژگی‌های بارز: \nآرام و كم حرف، متفكر و دانا، با شخصيت، قابل‌اعتماد، پر انرژی و پرشور و حرارت، عاشق مسائل مرموز و پوشيده، حامی خانواده، قدرتمند و بلندپرواز، در دوستی استوار و در دشمنی انتقام‌جو، مشكوك و كنجكاو، عاشق روانكاوی و روانشناسی، موقع‌شناس و جاه‌طلب، پرجاذبه و نيرومند، اگر پزشك شود بهترين طبيب دنيا."
    elif (m == 9):
        ans = "خصوصيات متولدين قوس ( آذر)\nسمبل: كمان دار \nعنصر: آتش \nسیاره: ژوپیتر \nعضو آسیب پذیر: كبد \nروز اقبال: پنج شنبه \nاعداد شانس: 5 و 7 \nسنگ خوش یمن: فیروزه \nرنگ: ارغوانی \nگل: نرگس \nحیوان: اسب\nویژگی‌های بارز: \nصاف و ساده، دل رحم، اهل منطق و واقعيات، مهماندوست، دعوايی و زودرنج، علاقهمند به سير و سفر و گردش، عاشق معاشرت و دوست يابی، رنگارنگ و دمدمی مزاج، اهل زد و بند نيست، عاشق آزادی و گردش است، زود خسته ميشود، مخالف زناشويی است، مرتب وسايل خود را جا می‌گذارد"
    elif (m == 10):
        ans = "خصوصيات متولدين جدی (دی)\nسمبل: بز \nعنصر: خاك \nسیاره: زحل \nعضو آسیب‌پذیر: زانو - استخوان \nروز اقبال: شنبه \nاعداد شانس: 8 و 9 \nسنگ خوش‌یمن: عقیق رنگارنگ \nرنگ: سیاه و قهوه‌ای \nویژگی‌های بارز: \nخونسرد و مداوم، اهل احتياط و دقت، مطيع و درعین‌حال ياغی، خشك ولی مهربان، قدرت‌طلب، ساده پوش و بی‌آلایش، دشمن ولخرجی و اسراف، در جمع می‌درخشد، كمی لجباز و زودرنج، خود دارو سرد، احساس مسئوليت می‌کند، خيلی فعال و كوشا است، جاه و مقام را به ثروت می‌فروشد"
    elif (m == 11):
        ans = "خصوصيات متولدين دلو ( بهمن)\nسمبل: آب گیر \nعنصر: هوا \nسیاره: زهره \nعضو آسیب‌پذیر: مچ و ساق پاها \nروز اقبال: چهارشنبه \nاعداد شانس: 1 و 7 \nسنگ خوش‌یمن: یاقوت ارغوانی \nرنگ: آبی \nحیوان: پرندگان درشت‌اندام\nویژگی‌های بارز:\nغافلگیرکننده، سریع‌الانتقال، كنجكاو، دارای قدرت پیش‌بینی، خوش‌بین و كم سوء ظن، خونسرد و رك گو، ذاتآ عاشق آدميان، كم علاقه به آداب و اصول سنتی، دوستی او عميق و شكوهمند است، ظريف عمل می‌کند، آسان زندگی می‌کند، هر چيز منطقی را می‌پذیرد."
    elif(m == 12):
        ans = "خصوصيات متولدين حوت ( اسفند)\nسمبل: دو ماهی كه خلاف جهت هم شنا می‌کنند. \nعنصر: آب \nسیاره: نپتون \nعضو آسیب‌پذیر: پاها \nروز اقبال: جمعه \nاعداد شانس: 2 و 6 \nسنگ خوش‌یمن: یاقوت كبود \nرنگ: سبز روشن \nگل: نسرین \nحیوان: ماهی\nویژگی‌های بارز: \nبسيار حساس و رويايی، خوش‌قلب و دل رحم، دارای حس ششم، كم تحرك و آرام، زودرنج، هنردوست، خونسرد و خوش‌اخلاق، كمی دودل و ترسو، باهوش و تا حدودی زيرك، هميشه موافق و سازش‌کار، در كارها زود تغيير جهت می‌دهد، عاشق صلح و آرامش، خواستار تشويق و حمایت."
    return ans

@bot.message_handler(commands=['start'])
def handle_start(message):
    user_markup = telebot.types.ReplyKeyboardMarkup(True, False)
    user_markup.row('/start')
    user_markup.row('تاریخ میلادی تولدم', 'محاسبه سن دقیقم !:)', 'روز تولدم')
    user_markup.row('دانستنی های سال تولدم', 'دانستنی های ماه تولدم ', 'فاصله باقی مانده تا تولدم')
    user_markup.row('وارد کردن تاریخ جدید')
    bot.send_message(message.from_user.id, 'سلام دوست من\n  لطفا تاریخ تولدت را به فرم 1381/07/05 برام بفرس:))', reply_markup=user_markup)

sall = 0
mah = 0
ros = 0

@bot.message_handler(content_types=['text'])
def handle_text(message):
    global sall
    global mah
    global roz
    if message.text[0] == "1":
         sall = int(message.text[0:4])
         mah = int(message.text[5:7])
         roz = int(message.text[8:10])
         bot.send_message(message.from_user.id, "هم اکنون امکانات ربات در اختیار شماست")
    elif (sall == mah):
         bot.send_message(message.from_user.id,"لطفا تاریخ تولدت وارد کن D:")
    elif message.text == "تاریخ میلادی تولدم":
         x = shamsi_to_miladi(sall, mah, roz)
         bot.send_message(message.from_user.id, "%s/%s/%s" % (x[0],x[1],x[2]))
    elif message.text == "محاسبه سن دقیقم !:)":
        x = mohesebesen(int(str(sall)[2:4]),mah,roz)
        bot.send_message(message.from_user.id, "سال:%s و %s روز\nهفته:%s \nروز:%s \nساعت:%s \nدقیقه:%s \nثانیه:%s " % (x[5],x[6],x[0],x[1],x[2],x[3],x[4]))
    elif message.text == "روز تولدم":
        bot.send_message(message.from_user.id,"تو متولد %s هستی !" % DayOfWeek_Shamsi(int(str(sall)[2:4]),mah,roz))
    elif message.text == "وارد کردن تاریخ جدید":
        bot.send_message(message.from_user.id, "لطفا تاریخ تولد را به همون فرمت قبلی وارد کن")
    elif message.text == "دانستنی های ماه تولدم":
        directory = 'C:\\Users\Mina\Desktop\python\\telebot\photo'
        all_files_in_directory = os.listdir(directory)
        img = open(directory + '/' + all_files_in_directory[mah-1], 'rb')
        bot.send_chat_action(message.from_user.id, 'upload_photo')
        bot.send_photo(message.from_user.id, img)
        bot.send_message(message.from_user.id, darbaremah(mah))
    elif message.text == "دانستنی های سال تولدم":
        bot.send_message(message.from_user.id, "تو متولد سال %s هستی !" % (chesali(sall)))
    elif message.text == "فاصله باقی مانده تا تولدم":
        x=chandroztosalgard(mah,roz)
        bot.send_message(message.from_user.id, "زمان باقی مانده تا تولدت : %s ماه و %s روز است " % (x[0], x[1]))
#update = file
bot.polling(none_stop=True)
